# Import needed libraries

In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

## Queries Needed

In [20]:
creat_db_query = "CREATE DATABASE mydb";

create_person_table = """
CREATE TABLE Person (
  phone VARCHAR(100)  PRIMARY KEY,
  name VARCHAR(100) NOT NULL,
  address VARCHAR(100) NOT NULL
  
  );
 """
person_insert_query = """
INSERT INTO Person VALUES
('Bruce Schneier', '12345', '795 E DRAGRAM Drive, TUCSON, AZ 85705-7598'),
('Schneier, Bruce', '(703)111-2121', '795 E DRAGRAM Dr., TUCSON, AZ 85705'), 
('Schneier, Bruce Wayne', '123-1234', '770W DRAGRAM Drive # 321, TUCSON, AZ 85703');
"""
list_query = """
SELECT * FROM Person;
"""

In [21]:
update_query = """
UPDATE Person 
SET address = '23 Fingiertweg, 14534 Berlin' 
WHERE phone = '12345';
"""
delete_query = """
DELETE FROM Person 
WHERE phone = '123-1234';
"""
drob_db = """
DROP DATABASE mydb;
"""
drop_table = """
DROP TABLE Person;
"""

# Connecting to MySQL Server

In [3]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

# Pass your computer password to the `pw` variable

In [4]:
pw = '11213141'
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

# Creating a New Database

In [5]:
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

In [6]:
create_database(connection, creat_db_query);

Database created successfully

# Connecting to the Database

In [7]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

# Creating a Query Execution Function

In [8]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

# Creating Tables

In [9]:
connection = create_db_connection("localhost", "root", pw, 'mydb'); # Connect to the Database
execute_query(connection, create_person_table); # Execute our defined query

MySQL Database connection successful
Query successful

# Add some data

In [10]:
connection = create_db_connection("localhost", "root", pw, 'mydb')
execute_query(connection, person_insert_query)

MySQL Database connection successful
Query successful

# Reading Data

In [11]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [12]:
connection = create_db_connection("localhost", "root", pw, 'mydb')
results = read_query(connection, list_query)
for result in results:
  print(result)

MySQL Database connection successful
('Schneier, Bruce Wayne', '123-1234', '770W DRAGRAM Drive # 321, TUCSON, AZ 85703')
('Schneier, Bruce', '(703)111-2121', '795 E DRAGRAM Dr., TUCSON, AZ 85705')
('Bruce Schneier', '12345', '795 E DRAGRAM Drive, TUCSON, AZ 85705-7598')

# Formatting Output into a pandas DataFrame

In [13]:
def formatOutput(results):
    from_db = []

    for result in results:
        result = list(result)
        from_db.append(result)


    columns = ["name", "phone", "address"]
    df = pd.DataFrame(from_db, columns=columns)
    return df

In [14]:
connection = create_db_connection("localhost", "root", pw, 'mydb')
results = read_query(connection, list_query)
formatOutput(results)

MySQL Database connection successful

,name,phone,address
0,"Schneier, Bruce Wayne",123-1234,"770W DRAGRAM Drive # 321, TUCSON, AZ 85703"
1,"Schneier, Bruce",(703)111-2121,"795 E DRAGRAM Dr., TUCSON, AZ 85705"
2,Bruce Schneier,12345,"795 E DRAGRAM Drive, TUCSON, AZ 85705-7598"

# Updating Records

In [15]:
connection = create_db_connection("localhost", "root", pw, 'mydb')
execute_query(connection, update_query)
results = read_query(connection, list_query)
formatOutput(results)

MySQL Database connection successful
Query successful

,name,phone,address
0,"Schneier, Bruce Wayne",123-1234,"770W DRAGRAM Drive # 321, TUCSON, AZ 85703"
1,"Schneier, Bruce",(703)111-2121,"795 E DRAGRAM Dr., TUCSON, AZ 85705"
2,Bruce Schneier,12345,"795 E DRAGRAM Drive, TUCSON, AZ 85705-7598"

# Deleting Records

In [17]:
connection = create_db_connection("localhost", "root", pw, 'mydb')
execute_query(connection, delete_query)
results = read_query(connection, list_query)
formatOutput(results)

MySQL Database connection successful
Query successful

,name,phone,address
0,"Schneier, Bruce Wayne",123-1234,"770W DRAGRAM Drive # 321, TUCSON, AZ 85703"
1,"Schneier, Bruce",(703)111-2121,"795 E DRAGRAM Dr., TUCSON, AZ 85705"
2,Bruce Schneier,12345,"795 E DRAGRAM Drive, TUCSON, AZ 85705-7598"

## Rebuilding the project (uncomment the below code):

In [ ]:
# connection = create_db_connection("localhost", "root", pw, 'mydb')
# execute_query(connection, drop_table)
# execute_query(connection, drob_db)

# References
[1] https://www.freecodecamp.org/news/connect-python-with-sql/